app/controllers/attendances_controller.rb

SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT 1  [["id", 0]]
---
	def show
		@user = User.find(session[:user_id])
		@events = @user.events
	  @attendance = Attendance.find(params[:id])