app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-10-03 23:57:00.620267"], ["updated_at", "2015-10-03 23:57:00.620267"]]
---
def create
  @event = Event.new(event_params)
  @attendance = Attendance.new(attend_params)

  if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "Final project"], ["updated_at", "2015-10-06 00:32:58.602264"], ["id", 7]]
---
def update
  @event = Event.find(params[:id])

  if @event.update(event_params)