app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Alex"], ["last_name", "Nelson"], ["email", "alexander.thomas.nelson@gmail.com"], ["created_at", "2015-10-09 01:55:41.878911"], ["updated_at", "2015-10-09 01:55:41.878911"]]
---
  def create
    @user= User.new(user_params)

    if @user.save